[
	{
		"version": "0.38.0",
		"date": "August 22, 2018",
		"features": [
			"Add support for everything in the selected part's 'Change Part' menu.  You can change a part's color, position, rotation and basic part type.  You can also duplicate a part or delete it.",
			"When there's multiple callouts in one step, add option to select which callout to add a selected part to",
			"When adding multiple callouts to one step, add them to different positions, not always just 'left'",
			"You can add a rotate icon to any step with step's new 'Add Rotate Icon' menu option",
			"You can delete a rotate icon by selecting it and hitting 'delete' or with the icon's 'Remove Icon' menu option"
		],
		"bug_fixes": [
			"Include callout's position in nav tree text, so you can tell multiple callouts apart",
			"Correctly add steps to a callout when selecting a step in a callout and using its 'Append Step' menu entry",
			"Don't crash when undoing / redoing an action on a selected item",
			"Fix bounding box around PLI Items to include quantity label",
			"Make sure context menu & submenus always appear entirely on the screen"
		]
	},
	{
		"version": "0.37.0",
		"date": "July 31, 2018",
		"features": [
			"Add 'Save As...' option for both Lic files and Lic Template files",
			"You can now edit brick colors before a model is imported",
			"Custom brick colors are now stored globally, and separately from the model; setting custom brick colors will apply to all imported models going forward",
			"The Page's template panel now includes the ability to pick pre-defined page sizes, like 'A4', 'Legal', 'Letter'.  You can also pick between Portrait and Landscape",
			"You can now set a custom DPI when exporting Hi-Res PNG images.  DPI can be set such that the scale factor is automatically calculated to preserve the current printed page size"
		],
		"bug_fixes": [
			"Make Page Layout lock icon lock & unlock when clicked",
			"Fix page layout on small screens so you can scroll to the top left corner of a page",
			"Remove line wrapping in navigation tree"
		]
	},
	{
		"version": "0.36.0",
		"date": "July 24, 2018",
		"features": [
			"Change the colors used for each LDraw color and edge with 'Edit -> Brick Colors...'",
			"New 'Style' right-click option for label annotations",
			"The 'delete' key will now delete selected page items that can be deleted (divider lines, annotations, empty callouts, steps, pages, etc)"
		],
		"bug_fixes": [
			"Don't crash when loading a model for the very first time",
			"Remove extraneous whitespace to the right of the page when visiting the site for the very first time",
			"Don't crash when creating an image annotation",
			"Correctly postion image annotations when they're relative to something that's not in the top left corner of the page",
			"Fully delete image annotations, so that re-adding them later doesn't crash"
		]
	},
	{
		"version": "0.35.0",
		"date": "July 20, 2018",
		"features": [
			"Stretch a single Step across multiple pages",
			"Set horizontal or vertical layout on Callouts",
			"Set Callout position relative to CSI (top, right, bottom, left)",
			"Add nice divider and arrow between the last step in a submodel and the step the submodel is placed on, when the two steps fall on the same page"
		],
		"bug_fixes": [
			"Better bounding boxes around labels",
			"Fix pattern drawing on parts with fixed color values"
		]
	},
	{
		"version": "0.34.0",
		"date": "July 1, 2018",
		"features": [
			"This new 'What's New' dialog",
			"Added Part List Pages.  Accessible from the 'Import Model' dialog's 'Include' list or from 'Edit -> Add Part List Pages",
			"Better 'Import Model' dialog, with new 'Include' dropdown, to better choose desired major page items",
			"If submodels are not shown in PLI, add an arrow from edge of page to submodel placement in CSI",
			"Add a right-click menu to Arrow Annotations, to select / add / remove points and rotate arrow tip"
		],
		"bug_fixes": [
			"Correct the position of annotations placed on Steps & CSIs",
			"Make Arrow Annotations selectable",
			"Redo page layout when PLI template options change",
			"Include Lic version info in all saved templates & instruction books",
			"Delete cached submodels when importing a new model"
		]
	}
]
