[
	{
		"version": "0.45.0",
		"date": "June 19, 2019",
		"features": [
			"Completely rewrite the 3D rendering engine, so it runs much faster and uses up less memory",
			"Completely rewrite the Navigation Tree to perform better",
			"Reorganize the part library so it loads much faster",
			"Add every LDraw part I could find to Lic's part library, including every unofficial part, so you should see the 'Missing Part' prompt less",
			"Show a new 'Getting Started' page when there is no open model",
			"Change the default view angle so it's more 'on top' of the model, so it's easier to see the build steps",
			"Change the UI used to create 3D rotations.  Instead of static 'X, Y, Z' input boxes, rotations are now a list of {axis, angle} entries, which are applied to the model in order.  This makes it much easier to create arbitrarily complex rotations, as the overall rotation can now be broken up arbitrarily",
			"Add a new 'Scene Rotation' entry to '3D part Rendering', which allows you to override the default scene rotation used for all 3D rendering",
			"Save nav tree expanded state so it's restored on page reload",
			"Dialogs will open with keyboard focus in the right spot now, for easier keyboard navigation",
			"'Enter' key will trigger 'Ok' on any dialog, and 'Esc' key will trigger 'Cancel'",
			"Better styling everywhere for longer non-English text"
		],
		"bug_fixes": [
			"Fix inventory page layout when one column was much wider than the others",
			"Now that 3D rendering is much faster, always shrink the model to fit nicely in the chosen page size",
			"When converting a submodel to callout, add the correct number of parts to the step's part list",
			"Use the correct edge color when coloring the side of stud outlines",
			"Avoid reloading entire page if 'Enter' is hit while any dialog is open"
		]
	},
	{
		"version": "0.44.0",
		"date": "May 11, 2019",
		"features": [
			"Move all remaining hardcoded strings into the translation lookup table - thanks mreid!",
			"New French translation - thanks again mreid!",
			"New German translation - thanks Jean-Philippe!",
			"New 'About Lic' dialog - click 'Web Lic' in the top right corner to see this"
		],
		"bug_fixes": [
			"If a submodel is used multiple times in different steps, any use beyond the first would draw wrong: each step drew the entire submodel.  Fix that nonsense.",
			"Draw nav tree icons when page first loads"
		]
	},
	{
		"version": "0.43.0",
		"date": "Nov 23, 2018",
		"features": [
			"Automatically add steps to models that have none.  This is very basic for now; parts are not reordered, steps are simply inserted every few parts.  How many parts per step can be set when importing the model.",
			"Add the ability to change the inner margin for page, pli, submodel images and callouts.  This can be done with the new 'Margin' entry under 'Border' on the Template Page."
		],
		"bug_fixes": [
			"Update the part list page when a part is deleted from the model"
		]
	},
	{
		"version": "0.42.0",
		"date": "Nov 12, 2018",
		"features": [
			"Add new dialog that lists parts in the model that can't be found, and makes it easy to upload missing parts before the model is fully imported",
			"Add option to change part edge width",
			"Add option to change 3D rendering camera zoom, to better handle big models",
			"Add option to automatically zoom out a nice distance for big models during model import"
		],
		"bug_fixes": [
			"When an LDraw file is missing both 'FILE' and 'NAME' commands, use the filename itself.  This fixes importing from LDD generated files.",
			"Fix bug that prevented an already imported model from being imported again",
			"Don't select PLIs if they're turned off",
			"Fix the PLI in submodel to callout conversion so it includes each part in the submodel, not just the submodel itself"
		]
	},
	{
		"version": "0.41.0",
		"date": "October 30, 2018",
		"bug_fixes": [
			"Draw nice thick edge lines even when exporting high-res images"
		]
	},
	{
		"version": "0.40.0",
		"date": "October 28, 2018",
		"features": [
			"Add support for 0xnnRRGGBB style color codes in LDraw models",
			"Add annotation option to title page and part list pages",
			"Add new 'Change Count' menu option to inventory page part count labels"
		],
		"bug_fixes": [
			"Force all base parts in a given LDraw file with invalid color codes to be black instead of rendering poorly"
		]
	},
	{
		"version": "0.39.0",
		"date": "October 18, 2018",
		"features": [
			"Add new 'Stud Face' color to list of Brick colors, which controls the color used on brick faces.  Can now be customized."
		],
		"bug_fixes": [
			"Fix high res PNG export",
			"Don't skip parts at the end of a model if there is multiple empty steps before them",
			"Include part list pages in image export",
			"Renumber part list pages when adding or removing a title page"
		]
	},
	{
		"version": "0.38.0",
		"date": "August 22, 2018",
		"features": [
			"Add support for everything in the selected part's 'Change Part' menu.  You can change a part's color, position, rotation and basic part type.  You can also duplicate a part or delete it.",
			"When there's multiple callouts in one step, add option to select which callout to add a selected part to",
			"When adding multiple callouts to one step, add them to different positions, not always just 'left'",
			"You can add a rotate icon to any step with step's new 'Add Rotate Icon' menu option",
			"You can delete a rotate icon by selecting it and hitting 'delete' or with the icon's 'Remove Icon' menu option"
		],
		"bug_fixes": [
			"Include callout's position in nav tree text, so you can tell multiple callouts apart",
			"Correctly add steps to a callout when selecting a step in a callout and using its 'Append Step' menu entry",
			"Don't crash when undoing / redoing an action on a selected item",
			"Fix bounding box around PLI Items to include quantity label",
			"Make sure context menu & submenus always appear entirely on the screen"
		]
	},
	{
		"version": "0.37.0",
		"date": "July 31, 2018",
		"features": [
			"Add 'Save As...' option for both Lic files and Lic Template files",
			"You can now edit brick colors before a model is imported",
			"Custom brick colors are now stored globally, and separately from the model; setting custom brick colors will apply to all imported models going forward",
			"The Page's template panel now includes the ability to pick pre-defined page sizes, like 'A4', 'Legal', 'Letter'.  You can also pick between Portrait and Landscape",
			"You can now set a custom DPI when exporting Hi-Res PNG images.  DPI can be set such that the scale factor is automatically calculated to preserve the current printed page size"
		],
		"bug_fixes": [
			"Make Page Layout lock icon lock & unlock when clicked",
			"Fix page layout on small screens so you can scroll to the top left corner of a page",
			"Remove line wrapping in navigation tree"
		]
	},
	{
		"version": "0.36.0",
		"date": "July 24, 2018",
		"features": [
			"Change the colors used for each LDraw color and edge with 'Edit -> Brick Colors...'",
			"New 'Style' right-click option for label annotations",
			"The 'delete' key will now delete selected page items that can be deleted (divider lines, annotations, empty callouts, steps, pages, etc)"
		],
		"bug_fixes": [
			"Don't crash when loading a model for the very first time",
			"Remove extraneous whitespace to the right of the page when visiting the site for the very first time",
			"Don't crash when creating an image annotation",
			"Correctly postion image annotations when they're relative to something that's not in the top left corner of the page",
			"Fully delete image annotations, so that re-adding them later doesn't crash"
		]
	},
	{
		"version": "0.35.0",
		"date": "July 20, 2018",
		"features": [
			"Stretch a single Step across multiple pages",
			"Set horizontal or vertical layout on Callouts",
			"Set Callout position relative to CSI (top, right, bottom, left)",
			"Add nice divider and arrow between the last step in a submodel and the step the submodel is placed on, when the two steps fall on the same page"
		],
		"bug_fixes": [
			"Better bounding boxes around labels",
			"Fix pattern drawing on parts with fixed color values"
		]
	},
	{
		"version": "0.34.0",
		"date": "July 1, 2018",
		"features": [
			"This new 'What's New' dialog",
			"Added Part List Pages.  Accessible from the 'Import Model' dialog's 'Include' list or from 'Edit -> Add Part List Pages",
			"Better 'Import Model' dialog, with new 'Include' dropdown, to better choose desired major page items",
			"If submodels are not shown in PLI, add an arrow from edge of page to submodel placement in CSI",
			"Add a right-click menu to Arrow Annotations, to select / add / remove points and rotate arrow tip"
		],
		"bug_fixes": [
			"Correct the position of annotations placed on Steps & CSIs",
			"Make Arrow Annotations selectable",
			"Redo page layout when PLI template options change",
			"Include Lic version info in all saved templates & instruction books",
			"Delete cached submodels when importing a new model"
		]
	}
]
